{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "bias": true, "name": "convolution2d_1", "subsample": [2, 2], "nb_col": 5, "nb_filter": 24}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "bias": true, "name": "convolution2d_2", "subsample": [2, 2], "nb_col": 5, "nb_filter": 36}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "bias": true, "name": "convolution2d_3", "subsample": [2, 2], "nb_col": 5, "nb_filter": 48}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 3, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_5", "subsample": [1, 1], "nb_col": 3, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "input_dim": 1152, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_1"}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "input_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_2"}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "input_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_3"}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "input_dim": 10, "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_4"}}]}