{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u000b\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "trainable": true, "name": "lambda_1", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 24, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 36, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "name": "convolution2d_2", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 48, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "name": "convolution2d_3", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_constraint": null, "name": "convolution2d_4", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_constraint": null, "name": "convolution2d_5", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 1152, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "output_dim": 100, "activation": "linear", "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "output_dim": 50, "activation": "linear", "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_3", "output_dim": 10, "activation": "linear", "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_4", "output_dim": 1, "activation": "linear", "b_constraint": null, "W_regularizer": null}}], "keras_version": "1.2.0"}