{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "input_dtype": "float32", "W_regularizer": null, "nb_filter": 24, "border_mode": "valid", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 66, 200, 3], "name": "convolution2d_1", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "nb_filter": 36, "border_mode": "valid", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_2", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "nb_filter": 48, "border_mode": "valid", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_3", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_4", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_5", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "input_dim": 1152, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_1", "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "input_dim": 100, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_2", "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "input_dim": 50, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_3", "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "input_dim": 10, "W_regularizer": null, "name": "dense_4", "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}