{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\n\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 24, "activation": "linear", "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 36, "activation": "linear", "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 48, "activation": "linear", "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 100, "input_dim": 1152, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_3", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_4", "bias": true}}]}