{"config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u000b\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "trainable": true, "arguments": {}}, "class_name": "Lambda"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "nb_filter": 24, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "nb_filter": 36, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "nb_filter": 48, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "input_dim": 1152, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "bias": true, "output_dim": 100, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "bias": true, "output_dim": 50, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "bias": true, "output_dim": 10, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "bias": true, "output_dim": 1, "b_constraint": null, "activation": "linear", "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}