{"keras_version": "1.2.0", "config": [{"config": {"input_dtype": "float32", "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 3], "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "nb_row": 5, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "nb_row": 5, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "nb_row": 5, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "nb_row": 3, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "nb_row": 3, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "input_dim": 1152, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_1", "W_constraint": null, "activation": "tanh", "init": "glorot_uniform", "output_dim": 100, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 100, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_2", "W_constraint": null, "activation": "tanh", "init": "glorot_uniform", "output_dim": 50, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 50, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_3", "W_constraint": null, "activation": "tanh", "init": "glorot_uniform", "output_dim": 10, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 10, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_4", "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}