{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_2", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_3", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_4", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_5", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "W_regularizer": null, "output_dim": 100, "bias": true, "input_dim": 1152, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "W_regularizer": null, "output_dim": 50, "bias": true, "input_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "W_regularizer": null, "output_dim": 10, "bias": true, "input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_4", "W_regularizer": null, "output_dim": 1, "bias": true, "input_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.0"}