{"config": [{"config": {"init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": null, "bias": true, "input_dtype": "float32", "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "batch_input_shape": [null, 66, 200, 3], "dim_ordering": "tf", "nb_filter": 24, "W_constraint": null, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "name": "convolution2d_2", "W_regularizer": null, "bias": true, "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 36, "W_constraint": null, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "name": "convolution2d_3", "W_regularizer": null, "bias": true, "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 48, "W_constraint": null, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "convolution2d_4", "W_regularizer": null, "bias": true, "activation": "linear", "nb_col": 3, "trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "name": "convolution2d_5", "W_regularizer": null, "bias": true, "activation": "linear", "nb_col": 3, "trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "W_regularizer": null, "bias": true, "activation": "tanh", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 1152, "output_dim": 100, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "W_regularizer": null, "bias": true, "activation": "tanh", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "W_regularizer": null, "bias": true, "activation": "tanh", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_4", "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}