{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "b_constraint": null, "nb_col": 5, "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "input_dtype": "float32", "nb_row": 5, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "trainable": true, "nb_col": 5, "b_constraint": null, "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "trainable": true, "nb_col": 5, "b_constraint": null, "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "trainable": true, "nb_col": 3, "b_constraint": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "trainable": true, "nb_col": 3, "b_constraint": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1152, "activation": "tanh", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100, "activation": "tanh", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50, "activation": "tanh", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 10, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_4"}}], "keras_version": "1.2.0"}