{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "input_dtype": "float32", "output_shape": null, "arguments": {}, "trainable": true, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0000\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 36, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 48, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "tanh", "name": "dense_1", "init": "glorot_uniform", "input_dim": 1152, "trainable": true, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "tanh", "name": "dense_2", "init": "glorot_uniform", "input_dim": 100, "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "tanh", "name": "dense_3", "init": "glorot_uniform", "input_dim": 50, "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "name": "dense_4", "init": "glorot_uniform", "input_dim": 10, "trainable": true, "b_regularizer": null}}]}