{"keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 24, "input_dtype": "float32", "nb_col": 5, "bias": true, "batch_input_shape": [null, 66, 200, 3], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "b_constraint": null, "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "b_constraint": null, "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "b_constraint": null, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "b_constraint": null, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "trainable": true, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 100, "activation": "tanh", "W_regularizer": null, "activity_regularizer": null, "input_dim": 1152}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "trainable": true, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 50, "activation": "tanh", "W_regularizer": null, "activity_regularizer": null, "input_dim": 100}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "trainable": true, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 10, "activation": "tanh", "W_regularizer": null, "activity_regularizer": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_4", "trainable": true, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "output_dim": 1, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "input_dim": 10}}], "class_name": "Sequential"}