{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 66, 200, 3], "b_regularizer": null, "nb_filter": 24, "activation": "linear", "dim_ordering": "tf", "input_dtype": "float32", "border_mode": "valid", "W_constraint": null, "nb_col": 5, "name": "convolution2d_1", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "bias": true, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "dim_ordering": "tf", "activation": "linear", "nb_col": 5, "name": "convolution2d_2", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "dim_ordering": "tf", "activation": "linear", "nb_col": 5, "name": "convolution2d_3", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "name": "convolution2d_4", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "name": "convolution2d_5", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "trainable": true, "name": "dense_1", "input_dim": 1152, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "trainable": true, "name": "dense_2", "input_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "trainable": true, "name": "dense_3", "input_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_4", "input_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null}}]}