{"config": [{"config": {"input_dtype": "float32", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "nb_filter": 24, "activation": "linear", "bias": true, "batch_input_shape": [null, 66, 200, 3], "activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "activation": "linear", "nb_col": 5, "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "activation": "linear", "nb_col": 5, "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "linear", "nb_col": 3, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "activation": "linear", "nb_col": 3, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "tanh", "b_regularizer": null, "input_dim": 1152, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "tanh", "b_regularizer": null, "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "output_dim": 50}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "tanh", "b_regularizer": null, "input_dim": 50, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "bias": true, "output_dim": 10}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "bias": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}