{"config": [{"config": {"nb_filter": 24, "nb_col": 5, "input_dtype": "float32", "activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"nb_filter": 36, "nb_col": 5, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"nb_filter": 400, "nb_col": 1, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 1, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 128, "activity_regularizer": null, "input_dim": 244400, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 84, "activity_regularizer": null, "input_dim": 128, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "input_dim": 84, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}