{"config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "W_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "nb_row": 5, "bias": true, "nb_filter": 24, "trainable": true, "b_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 36, "b_constraint": null, "bias": true, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 48, "b_constraint": null, "bias": true, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "tanh", "W_regularizer": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 1152, "output_dim": 100, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "W_regularizer": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "W_regularizer": null, "name": "dense_3", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "dense_4", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}