{"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "input_dtype": "float32", "name": "convolution2d_1", "trainable": true, "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "batch_input_shape": [null, 66, 200, 3], "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "nb_filter": 24, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "bias": true, "nb_col": 5, "trainable": true, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "nb_filter": 36, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "bias": true, "nb_col": 5, "trainable": true, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "nb_filter": 48, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "bias": true, "nb_col": 3, "trainable": true, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "bias": true, "nb_col": 3, "trainable": true, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "input_dim": 1152, "b_constraint": null, "output_dim": 100, "name": "dense_1", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "input_dim": 100, "b_constraint": null, "output_dim": 50, "name": "dense_2", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "input_dim": 50, "b_constraint": null, "output_dim": 10, "name": "dense_3", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "input_dim": 10, "b_constraint": null, "output_dim": 1, "name": "dense_4", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}